// Squaring.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>

template<class T>
T Squaring(T a)
{
    return a * a;
}

template<>
std::vector<int> Squaring(std::vector<int> b)
{
    for (int i = 0; i < b.size(); i++)
    {
        b[i] = b[i] * b[i];
    }
    return b;
}

void print(std::vector<int> b)
{
    for (int i = 0; i < b.size(); i++) {
        std::cout << b.at(i) << ' ';
    }
    std::cout << std::endl;
}

int main()
{
    int a = 4;
    std::vector<int> b = {-1,5,3,-2};
    std::cout << "[IN] = " << a << std::endl;    
    std::cout << "[OUT] = " << Squaring(a) << std::endl;    
    std::cout << "[IN] = ";
    print(b);
    std::vector<int> с = Squaring(b);
    std::cout << "[OUT] = ";
    print(с);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
